; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 888851 2 2 4 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	image3 - mode
	infrared0 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star0 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star3 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star3)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Star10 thermograph2)
	(have_image Planet11 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
4. (turn_to satellite1 star10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star10)
   goals met: 0 of 5
5. (turn_to satellite0 star0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star0)
   goals met: 0 of 5
6. (turn_to satellite1 groundstation6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 5
7. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 5
9. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
10. (turn_to satellite1 star10 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star10)
   goals met: 0 of 5
11. (take_image satellite0 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 1 of 5
12. (take_image satellite1 star10 instrument2 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 2 of 5
13. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 2 of 5
14. (take_image satellite0 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 3 of 5
15. (turn_to satellite0 planet11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet11)
   goals met: 3 of 5
16. (take_image satellite0 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 5
17. (turn_to satellite0 groundstation5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation5)
   goals met: 5 of 5
